zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE327/MCXE327_cm7_core1_features.h
/* MC_ME module features */

/* @brief Has Partition 2 process configuration Registers */
#define FSL_FEATURE_MC_ME_HAS_PRTN2 (1)
/* @brief Has core selection to support multicore MCU */
#define FSL_FEATURE_MC_ME_HAS_CORE_SELECTION (1)

/* MC_RGM module features */

/* No feature definitions */

/* MEMORY module features */

/* @brief Memory map has offset between subsystems. */
#define FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET (1)

/* MSCM module features */

/* @brief Number of configuration information for processors. */
#define FSL_FEATURE_MSCM_HAS_CP_COUNT (2)
/* @brief Has data cache. */
#define FSL_FEATURE_MSCM_HAS_DATACACHE (0)

/* MU module features */

/* @brief MU side for current core */
#define FSL_FEATURE_MU_SIDE_A (1)
/* @brief MU side for current core */
#define FSL_FEATURE_MU_SIDE_B (1)
/* @brief MU supports reset assert interrupt. CIER0[RAIE] or CR[RAIE] or BCR[RAIE]. */
#define FSL_FEATURE_MU_HAS_RESET_ASSERT_INT (0)
/* @brief MU supports reset de-assert interrupt. CR[RDIE] or BCR[RDIE]. */
#define FSL_FEATURE_MU_HAS_RESET_DEASSERT_INT (0)
/* @brief MU does not support core status. Register CSSR0 or CSR0. Note: This feature value is not the same on all MU instances. */
#define FSL_FEATURE_MU_NO_CORE_STATUS (1)
/* @brief MU does not support NMI. Register bit CCR0[NMI]. Note: This feature value is not the same on all MU instances. */
#define FSL_FEATURE_MU_NO_NMI (1)
/* @brief MU does not support core event pending. Register bit SR[CEP]. */
#define FSL_FEATURE_MU_NO_CEP (1)
/* @brief MU supports Power-Down mode entry interrupt. CIER0[PDIE] */
#define FSL_FEATURE_MU_HAS_PD_INT (0)
/* @brief MU supports STOP mode entry interrupt. CIER0[STOPIE] */
#define FSL_FEATURE_MU_HAS_STOP_INT (0)
/* @brief MU supports WAIT mode entry interrupt. CIER0[WAITIE] */
#define FSL_FEATURE_MU_HAS_WAIT_INT (0)
/* @brief MU supports HALT mode entry interrupt. CIER0[HALTIE] */
#define FSL_FEATURE_MU_HAS_HALT_INT (0)
/* @brief MU supports RUN mode entry interrupt. CIER0[RUNIE] */
#define FSL_FEATURE_MU_HAS_RUN_INT (0)
/* @brief MU supports hardware reset interrupt. CSSR0[HRIP] or CSR0[HRIP]. */
#define FSL_FEATURE_MU_HAS_SR_HRIP (0)
/* @brief MU supports reset interrupt. Register bit SR[MURIP]. */
#define FSL_FEATURE_MU_HAS_SR_MURIP (1)
/* @brief MU does not support enable clock of the other core, CR[CLKE] or CCR[CLKE]. */
#define FSL_FEATURE_MU_NO_CLKE (1)
/* @brief MU has bit CCR0[RSTH]. */
#define FSL_FEATURE_MU_HAS_RSTH (0)
/* @brief MU has bit CCR0[RSTH] by instance. */
#define FSL_FEATURE_MU_HAS_RSTH_BY_INSTANCEn(x) (0)
/* @brief MU has bit CCR0[BOOT]. */
#define FSL_FEATURE_MU_HAS_BOOT (0)
/* @brief MU has bit CCR0[BOOT] by instance. */
#define FSL_FEATURE_MU_HAS_BOOT_BY_INSTANCEn(x) (0)
/* @brief MU supports MU reset, CR[MUR]. */
#define FSL_FEATURE_MU_HAS_MUR (1)
/* @brief MU supports hardware reset, CR[HR] or CCR0[HR]. */
#define FSL_FEATURE_MU_HAS_HR (0)
/* @brief MU supports hardware reset by instance */
#define FSL_FEATURE_MU_HAS_HR_BY_INSTANCEn(x) (0)
/* @brief The number of general purpose interrupts supported by MU. */
#define FSL_FEATURE_MU_GPI_COUNT (4)
/* @brief MU does not support CIER0 (Core Interrupt Enable 0) register. */
#define FSL_FEATURE_MU_NO_CIER0_REG (1)

/* NVIC module features */

/* @brief Lowest interrupt request number. */
#define FSL_FEATURE_INTERRUPT_IRQ_MIN (-14)
/* @brief Highest interrupt request number. */
#define FSL_FEATURE_INTERRUPT_IRQ_MAX (223)

/* PIT module features */

/* @brief Number of channels (related to number of registers LDVALn, CVALn, TCTRLn, TFLGn). */
#define FSL_FEATURE_PIT_TIMER_COUNT (4)
/* @brief Has lifetime timer (related to existence of registers LTMR64L and LTMR64H). Note: This feature value is not the same on all PIT instances. */
#define FSL_FEATURE_PIT_HAS_LIFETIME_TIMER (1)
/* @brief Has chain mode (related to existence of register bit field TCTRLn[CHN]). */
#define FSL_FEATURE_PIT_HAS_CHAIN_MODE (1)
/* @brief Has shared interrupt handler (has not individual interrupt handler for each channel). */
#define FSL_FEATURE_PIT_HAS_SHARED_IRQ_HANDLER (1)
/* @brief Has timer enable control. */
#define FSL_FEATURE_PIT_HAS_MDIS (1)
/* @brief Has Real Time Interrupt. */
#define FSL_FEATURE_PIT_HAS_RTI (1)
/* @brief Has ERRATA 7914. */
#define FSL_FEATURE_PIT_HAS_ERRATA_7914 (0)

/* PMC module features */

/* @brief Has 1.5v supply input (register bit fields LVSC[LVD15S], LVSC[LVD15F]). */
#define FSL_FEATURE_PMC_HAS_15V_SUPPLY (1)
/* @brief Has last mile regulator (register bit fields CONFIG[LMSTAT], CONFIG[LMAUTOEN], CONFIG[LMBCTLEN], CONFIG[LMEN]). */
#define FSL_FEATURE_PMC_HAS_LAST_MILE_REGULATOR (1)
/* @brief Has VDD_HV_B power supply input (register bit fields LVSC[HVDBF], LVSC[HVDBS], LVSC[LVRBF], LVSC[LVRBLPF], CONFIG[LVRBLPEN]). */
#define FSL_FEATURE_PMC_HAS_VDD_HV_B_SUPPLY (1)

/* QSPI module features */

/* @brief QSPI lookup table depth. */
#define FSL_FEATURE_QSPI_LUT_DEPTH (20)
/* @brief QSPI LUT SEQ unit. */
#define FSL_FEATURE_QSPI_LUT_SEQ_UNIT (5U)
/* @brief QSPI Tx FIFO depth. */
#define FSL_FEATURE_QSPI_TXFIFO_DEPTH (32)
/* @brief QSPI Rx FIFO depth. */
#define FSL_FEATURE_QSPI_RXFIFO_DEPTH (64)
/* @brief QSPI AHB buffer count. */
#define FSL_FEATURE_QSPI_AHB_BUFFER_COUNT (4)
/* @brief QSPI AHB buffer size in byte. */
#define FSL_FEATURE_QSPI_AHB_BUFFER_SIZE (256U)
/* @brief QSPI AMBA base address. */
#define FSL_FEATURE_QSPI_AMBA_BASE (0x68000000U)
/* @brief QSPI AHB buffer ARDB base address. */
#define FSL_FEATURE_QSPI_ARDB_BASE (0x67000000U)
/* @brief QSPI has command usage error flag. */
#define FSL_FEATURE_QSPI_HAS_IP_COMMAND_USAGE_ERROR (0)
/* @brief QSPI support parallel mode. */
#define FSL_FEATURE_QSPI_SUPPORT_PARALLEL_MODE (0)
/* @brief QSPI support individual mode. */
#define FSL_FEATURE_QSPI_SUPPORT_INDIVIDUAL_MODE (0)
/* @brief QSPI supoorts single mode. */
#define FSL_FEATURE_QSPI_SUPPORT_SINGLE_MODE (1)
/* @brief QSPI support dual die. */
#define FSL_FEATURE_QSPI_SUPPORT_DUAL_DIE (1)
/* @brief there is  no SCLKCFG bit in MCR register. */
#define FSL_FEATURE_QSPI_CLOCK_CONTROL_EXTERNAL (1)
/* @brief there is no AITEF bit in FR register. */
#define FSL_FEATURE_QSPI_HAS_NO_AITEF (1)
/* @brief  there is no AIBSEF bit in FR register. */
#define FSL_FEATURE_QSPI_HAS_NO_AIBSEF (0)
/* @brief there is no TXDMA and TXWA bit in SR register. */
#define FSL_FEATURE_QSPI_HAS_NO_TXDMA (0)
/* @brief there is no SFACR register. */
#define FSL_FEATURE_QSPI_HAS_NO_SFACR (1)
/* @brief there is no TDH bit in FLSHCR register. */
#define FSL_FEATURE_QSPI_HAS_NO_TDH (1)
/* @brief there is no END_CFG bit in MCR register. */
#define FSL_FEATURE_QSPI_HAS_NO_MCR_END (1)
/* @brief QSPI has no SOCCR register. */
#define FSL_FEATURE_QSPI_HAS_NO_SOCCR_REG (0)
/* @brief there is DLLCRA register. */
#define FSL_FEATURE_QSPI_HAS_DLLCRA (1)
/* @brief there is data learning feature. */
#define FSL_FEATURE_QSPI_HAS_DATA_LEARNING (0)
/* @brief there is AHB Command priority granted. */
#define FSL_FEATURE_QSPI_HAS_AHB_CMD_PRIORITY (0)
/* @brief there is AHB sequence error status flag. */
#define FSL_FEATURE_QSPI_HAS_AHB_SEQ_ERR (0)
/* @brief there is Tx buffer enough data available flag. */
#define FSL_FEATURE_QSPI_HAS_TX_BUFF_ENOUGH_DATA (0)
/* @brief QSPI has DDR mode. */
#define FSL_FEATURE_QSPI_HAS_DDR (0)
/* @brief there is no RXBRD bit in RBCT register. */
#define FSL_FEATURE_QSPI_HAS_NO_RXBRD (1)
/* @brief SOC specific configuration is needed. */
#define FSL_FEATURE_QSPI_HAS_SOC_SPECIFIC_CONFIG (1)

/* RTC module features */

/* No feature definitions */

